#+title: Straight Emacs with built-in LSP and Tree Sitter
#+author: Azizul Rahman Azizan
#+PROPERTY: header-args:emacs-lisp :tangle ./init.el :mkdirp yes
#+STARTUP: showAll

** password store (auth-source-pass)

   This is used to pass encrypted password in *pass* program in startup scripts.
   #+begin_src emacs-lisp
     (use-package auth-source-pass
       :straight (:type built-in))
   #+end_src

   Using the above library with =main.gmail= is registered in *pass* program
   #+begin_src sh :results output :tangle no
     pass
   #+end_src
   
   #+RESULTS:
   : Password Store
   : └── main.gmail

   #+begin_src emacs-lisp :tangle no
     (auth-source-pass-get 'secret "main.gmail")
   #+end_src

